rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Inc/debug_console.h
#ifndef DEBUG_CONSOLE_H
#define DEBUG_CONSOLE_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include "stm32n6xx_hal.h"

#if defined(__GNUC__) || defined(__clang__)
#define DEBUG_CONSOLE_PRINTF_LIKE(format_index, first_arg_index) \
	__attribute__((format(printf, format_index, first_arg_index)))
#else
#define DEBUG_CONSOLE_PRINTF_LIKE(format_index, first_arg_index)
#endif

/* Optional lock callbacks for thread-safety (FreeRTOS mutex, critical section, etc.) */
typedef void (*DebugConsole_LockCallback_t)(void);
typedef void (*DebugConsole_UnlockCallback_t)(void);

typedef struct {
	UART_HandleTypeDef *uart_handle_pointer;
	uint32_t uart_transmit_timeout_milliseconds;
	DebugConsole_LockCallback_t lock_callback;
	DebugConsole_UnlockCallback_t unlock_callback;
} DebugConsole_Configuration_t;

/* Public API */
bool DebugConsole_Init(
		const DebugConsole_Configuration_t *configuration_pointer);

/* Install or replace lock/unlock callbacks after init — call once ThreadX is running */
void DebugConsole_SetLockCallbacks(DebugConsole_LockCallback_t lock,
		DebugConsole_UnlockCallback_t unlock);

bool DebugConsole_IsInitialized(void);

/**
 * @brief Return whether a pointer/length pair belongs to a camera frame.
 *
 * This is the final transport safety check used by both formatted and raw
 * console writes.  Camera bytes must go to FileX or an explicitly requested
 * offline dump, never to the human-readable UART stream.
 */
bool DebugConsole_IsCameraBufferRange(const uint8_t *byte_array_pointer,
		size_t byte_array_length);

bool DebugConsole_WriteBytes(const uint8_t *byte_array_pointer,
		size_t byte_array_length);

/**
 * @brief Enables or disables the console-wide snapshot-copy suppression gate.
 * @param suppressed true while a camera snapshot owns the UART boundary.
 * @sideeffect Causes ordinary log writes to return without touching the UART.
 * @note Snapshot boundary markers use the dedicated exception API below.
 */
void DebugConsole_SetSnapshotCopySuppressed(bool suppressed);

/**
 * @brief Writes one already-formatted snapshot boundary marker.
 * @param byte_array_pointer Pointer to the short text marker.
 * @param byte_array_length Marker length in bytes.
 * @retval true when the marker was serialized to the UART.
 * @retval false when the console is unavailable or currently occupied.
 * @sideeffect Temporarily owns the console transport; this API is the only
 * exception to the snapshot-copy UART-suppression gate.
 * @note The caller must have raised the snapshot-copy active flag before
 * calling this function. It never transmits camera-buffer memory.
 */
bool DebugConsole_WriteSnapshotCopyMarker(
		const uint8_t *byte_array_pointer, size_t byte_array_length);

bool DebugConsole_Printf(const char *format_string_pointer, ...)
		DEBUG_CONSOLE_PRINTF_LIKE(1, 2);

bool DebugConsole_VPrintf(const char *format_string_pointer,
		void *va_list_pointer) DEBUG_CONSOLE_PRINTF_LIKE(1, 0);
int DebugConsole_Snprintf(char *destination_pointer, size_t destination_length,
		const char *format_string_pointer, ...)
		DEBUG_CONSOLE_PRINTF_LIKE(3, 4);

/* Convenience: write a C string (no formatting) */
bool DebugConsole_WriteString(const char *null_terminated_string_pointer);

#ifndef DEBUG_CONSOLE_IMPLEMENTATION
/*
 * Keep the logging API easy to disable in size-constrained builds.
 * When enabled, the callsites compile out entirely so their format strings
 * and message literals do not end up in ROM.
 */
#ifndef DEBUG_CONSOLE_ENABLE_LOGS
#define DEBUG_CONSOLE_ENABLE_LOGS 1
#endif

#if !DEBUG_CONSOLE_ENABLE_LOGS
#undef DebugConsole_Printf
#define DebugConsole_Printf(...) ((void) 0)
#undef DebugConsole_VPrintf
#define DebugConsole_VPrintf(...) ((void) 0)
#undef DebugConsole_WriteString
#define DebugConsole_WriteString(...) ((void) 0)
#endif
#endif

#ifdef __cplusplus
}
#endif

#endif /* DEBUG_CONSOLE_H */
